docs/mathematics/linear_algebra/KBrefMinimizingDistanceToSubspace.tex
% Created 2021-09-12 Sun 22:49
% Intended LaTeX compiler: xelatex
\documentclass[letterpaper]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{fontspec}
\usepackage{indentfirst}
\setmainfont[ItalicFont = LiberationSans-Italic, BoldFont = LiberationSans-Bold, BoldItalicFont = LiberationSans-BoldItalic]{LiberationSans}
\newfontfamily\NHLight[ItalicFont = LiberationSansNarrow-Italic, BoldFont       = LiberationSansNarrow-Bold, BoldItalicFont = LiberationSansNarrow-BoldItalic]{LiberationSansNarrow}
\newcommand\textrmlf[1]{{\NHLight#1}}
\newcommand\textitlf[1]{{\NHLight\itshape#1}}
\let\textbflf\textrm
\newcommand\textulf[1]{{\NHLight\bfseries#1}}
\newcommand\textuitlf[1]{{\NHLight\bfseries\itshape#1}}
\usepackage{fancyhdr}
\pagestyle{fancy}
\usepackage{titlesec}
\usepackage{titling}
\makeatletter
\lhead{\textbf{\@title}}
\makeatother
\rhead{\textrmlf{Compiled} \today}
\lfoot{\theauthor\ \textbullet \ \textbf{2021-2022}}
\cfoot{}
\rfoot{\textrmlf{Page} \thepage}
\titleformat{\section} {\Large} {\textrmlf{\thesection} {|}} {0.3em} {\textbf}
\titleformat{\subsection} {\large} {\textrmlf{\thesubsection} {|}} {0.2em} {\textbf}
\titleformat{\subsubsection} {\large} {\textrmlf{\thesubsubsection} {|}} {0.1em} {\textbf}
\setlength{\parskip}{0.45em}
\renewcommand\maketitle{}
\author{Taproot}
\date{\today}
\title{Minimizing the Distance to a Subspace}
\hypersetup{
 pdfauthor={Taproot},
 pdftitle={Minimizing the Distance to a Subspace},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{Axler6.56 Minimizing the distance to a subspace}
\label{sec:org50bf756}
\begin{quote}
Suppose \(U\) is a finite-dimensional subspace of \(V\), \(v \in  V\), and \(u \in  U\). Then,
\[\begin{aligned}
  \lVert v - P_U v \rVert \leq  \lVert v - u \rVert
  \end{aligned}\]
\end{quote}

Because we often end up having to find the minimal \(v - u\) where \(u \in  U\), this result makes linear algebra applicable to numerous real-world applications.

\subsection{Proof}
\label{sec:org3a84282}

\[\begin{aligned}
   \lVert v - P_U v \rVert ^2 &\leq  \lVert v - P_U v \rVert ^2 + \lVert P_U v - u \rVert ^2  &\quad& \text{ by } 0 \leq  \lVert P_U v - u \rVert ^2\\
   &= \lVert (v - P_U v) + (P_U v - u) \rVert ^2 &\quad& \text{ by the Pythagorean Theorem }\\
   &= \lVert v - u \rVert ^2
   \end{aligned}\]

Inequality is an equality only when \(u = P_U v\).

\subsection{An example}
\label{sec:org458785b}
First define an inner product that will be our cost function. In this case, they use the integral of \(f(x) g(x)\) on the range \([ - \pi , \pi ]\). Then, orthonormalize a basis of the polynomials up to degree 6 (using the Gram-Schmidt procedure) and take the orthonormal projection using the same inner product. This ends up with roughly
\[\begin{aligned}
   u(x) = 0.987862x - 0.155271x^3 + 0.00564312x^5
   \end{aligned}\]
Which ends up being a better approximation for the range than the corresponding 5-th degree Taylor polynomial.
\end{document}
